---
type: DocumentValidation
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# DocumentValidation

`Autodesk.Revit.DB.DocumentValidation` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CanDeleteElement | 2015 | `public static bool CanDeleteElement ( Document document , ElementId elementId )` |